#+title: Parametric Specification Table

#+attr_latex: :float multicolumn :placement [ht]
#+attr_latex: :environment tabularx :width .795\textwidth :align |l|c|c|l|
#+caption: Parametric specification example
#+label: tbl:param-spec-example
|--------------+----+--------------------+-----------------------------------------------------------|
| Editing type | ID | name               | persistent name                                           |
|--------------+----+--------------------+-----------------------------------------------------------|
| INIT         |  1 | Create-square      |                                                           |
|--------------+----+--------------------+-----------------------------------------------------------|
| INIT         |  2 | extrude-face       | $PN_{1}$ = [$1n_{0}$]                                     |
|--------------+----+--------------------+-----------------------------------------------------------|
| INIT         |  3 | insert-vertex      | $PN_{2}$ = [$1n_{2} - 2n_{5}$]                            |
|--------------+----+--------------------+-----------------------------------------------------------|
| INIT         |  4 | extrude-face       | $PN_{3}$ = [$1n_{0} - 2n_{6}$]                            |
|--------------+----+--------------------+-----------------------------------------------------------|
| INIT         |  5 | face-triangulation | $PN_{4}$ = [$1n_{0} - 2n_{1}$]                            |
|--------------+----+--------------------+-----------------------------------------------------------|
| INIT         |  6 | collapse-face      | $PN_{5}$ = [$1n_{1} - 2n_{5} - 4n_{6}$]                   |
|--------------+----+--------------------+-----------------------------------------------------------|
| INIT         |  7 | chamfer-corner     | $PN_{6}$ = [$1n_{2} - 2n_{5} - 3n_{0} - 4n_{3} - 6n_{2}$] |
|--------------+----+--------------------+-----------------------------------------------------------|
| INIT         |  8 | color-face         | $PN_{7}$ = [$1n_{0} - 2n_{1} - 5n_{1}$]                   |
|--------------+----+--------------------+-----------------------------------------------------------|
#+TBLFM: $2=(@#-1)
